In [1]:
import pandas as pd
import numpy as np

**Loading, cleaning, transforming and rearranging** take up 80% or more of an analyst's time.  

Sometimes the way that data is stored in files or databases is not in the right format for a particular task. Many researchers choose to do ad hoc processing of data from one form to another using a general-purpose programming language, like Python, Perl, R or Java to manipulate data into the right form.

# 1. Handling Missing Data

For numeric data, pandas uses the floating-point value **NaN**(Not a Number) to represent missing data. (*sentinel value*)

In [2]:
string_data = pd.Series(['a','bb','ccc',np.nan, 'dddd'])
string_data

0       a
1      bb
2     ccc
3     NaN
4    dddd
dtype: object

In [3]:
string_data.isnull()

0    False
1    False
2    False
3     True
4    False
dtype: bool

In [4]:
string_data[0] = None # Python build-in object
string_data.isnull()

0     True
1    False
2    False
3     True
4    False
dtype: bool

* **dropna**: Filter axis labels based on whether values for each label have missing data, with varying thresholds for how much missing data to tolerate.  
* **fillna**: Fill in missing data with some value or using an interpolation method such as'ffill'or'bfill'.  
* **isnull**: return boolean values indicating which values are missing/NA.  
* **notnull**: Negation of isnull.

In [5]:
string_data.fillna(0)

0       0
1      bb
2     ccc
3       0
4    dddd
dtype: object

In [6]:
string_data.ffill() # NaN filled same as previous value

0    None
1      bb
2     ccc
3     ccc
4    dddd
dtype: object

In [7]:
string_data.bfill() # NaN filled same as later value

0      bb
1      bb
2     ccc
3    dddd
4    dddd
dtype: object

In [8]:
string_data.dropna()

1      bb
2     ccc
4    dddd
dtype: object

## Filtering Out Missing Data

In [9]:
from numpy import nan as NA

In [10]:
data = pd.Series([1, NA, 3, 4, NA, 5])

In [11]:
data.dropna()

0    1.0
2    3.0
3    4.0
5    5.0
dtype: float64

In [12]:
data[data.isnull()]

1   NaN
4   NaN
dtype: float64

In [13]:
data[data.notnull()] # Equivalent to dropna().

0    1.0
2    3.0
3    4.0
5    5.0
dtype: float64

With DataFrame objects, things are a bit more complex. You may want to drop rows or columns that are all NA or only those containing any NAs.

In [14]:
data = pd.DataFrame([[1., 2., 3.], 
                     [4., NA, NA],
                     [NA, NA, NA], 
                     [NA, 11., 12.]])
data

     0     1     2
0  1.0   2.0   3.0
1  4.0   NaN   NaN
2  NaN   NaN   NaN
3  NaN  11.0  12.0

> *dropna() by default drops any row containing a missing value*

In [15]:
data.dropna()

     0    1    2
0  1.0  2.0  3.0

> *passing **how='all'** will only drop rows that are all NaN.*

In [16]:
data.dropna(how='all')

     0     1     2
0  1.0   2.0   3.0
1  4.0   NaN   NaN
3  NaN  11.0  12.0

In [17]:
data['4'] = NA

In [18]:
data

     0     1     2   4
0  1.0   2.0   3.0 NaN
1  4.0   NaN   NaN NaN
2  NaN   NaN   NaN NaN
3  NaN  11.0  12.0 NaN

> To drop columns in the same way, pass **axis=1**.

In [19]:
data.dropna(axis=1, how='all')

     0     1     2
0  1.0   2.0   3.0
1  4.0   NaN   NaN
2  NaN   NaN   NaN
3  NaN  11.0  12.0

If we only want to keep rows containing a certain number of observations. We can add **thresh** augument.

In [20]:
df = pd.DataFrame(np.random.randn(7,3))
df.iloc[:4, 1] = NA
df.iloc[:2, 2] = NA
df

          0         1         2
0 -0.515779       NaN       NaN
1 -0.050850       NaN       NaN
2  0.059893       NaN  1.325651
3 -1.160278       NaN  1.034061
4  0.966224  0.518087 -0.436198
5  0.803092  0.695176  1.133155
6  1.119618  0.299354 -2.031910

In [21]:
df.dropna() # drop all the rows contains NaN

          0         1         2
4  0.966224  0.518087 -0.436198
5  0.803092  0.695176  1.133155
6  1.119618  0.299354 -2.031910

In [22]:
df[3] = NA
df[3].astype('float')
df

          0         1         2   3
0 -0.515779       NaN       NaN NaN
1 -0.050850       NaN       NaN NaN
2  0.059893       NaN  1.325651 NaN
3 -1.160278       NaN  1.034061 NaN
4  0.966224  0.518087 -0.436198 NaN
5  0.803092  0.695176  1.133155 NaN
6  1.119618  0.299354 -2.031910 NaN

In [23]:
df.dropna(thresh=3) # Keep only the rows with at least 3 non-na values:

          0         1         2   3
4  0.966224  0.518087 -0.436198 NaN
5  0.803092  0.695176  1.133155 NaN
6  1.119618  0.299354 -2.031910 NaN

## Filling In Missing Data

In [24]:
df

          0         1         2   3
0 -0.515779       NaN       NaN NaN
1 -0.050850       NaN       NaN NaN
2  0.059893       NaN  1.325651 NaN
3 -1.160278       NaN  1.034061 NaN
4  0.966224  0.518087 -0.436198 NaN
5  0.803092  0.695176  1.133155 NaN
6  1.119618  0.299354 -2.031910 NaN

In [25]:
df.fillna(0)

          0         1         2    3
0 -0.515779  0.000000  0.000000  0.0
1 -0.050850  0.000000  0.000000  0.0
2  0.059893  0.000000  1.325651  0.0
3 -1.160278  0.000000  1.034061  0.0
4  0.966224  0.518087 -0.436198  0.0
5  0.803092  0.695176  1.133155  0.0
6  1.119618  0.299354 -2.031910  0.0

> By passing a dictionary, can use different fill value for each column.

In [26]:
df.fillna({1: 0.9999, 2: 0.8888, 3:0.7777 })

          0         1         2       3
0 -0.515779  0.999900  0.888800  0.7777
1 -0.050850  0.999900  0.888800  0.7777
2  0.059893  0.999900  1.325651  0.7777
3 -1.160278  0.999900  1.034061  0.7777
4  0.966224  0.518087 -0.436198  0.7777
5  0.803092  0.695176  1.133155  0.7777
6  1.119618  0.299354 -2.031910  0.7777

> fillna returns a new object, but add argument inplace=Ture will change inplace.

In [27]:
df.fillna(0, inplace=True)
df

          0         1         2    3
0 -0.515779  0.000000  0.000000  0.0
1 -0.050850  0.000000  0.000000  0.0
2  0.059893  0.000000  1.325651  0.0
3 -1.160278  0.000000  1.034061  0.0
4  0.966224  0.518087 -0.436198  0.0
5  0.803092  0.695176  1.133155  0.0
6  1.119618  0.299354 -2.031910  0.0

In [28]:
df = pd.DataFrame(np.random.randn(6, 3))
df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA
df

          0         1         2
0  0.638889 -0.628628  0.227867
1 -1.754156 -0.849572  0.499041
2  0.203560       NaN  0.121463
3 -0.383999       NaN  0.258524
4  0.650574       NaN       NaN
5  0.912157       NaN       NaN

In [29]:
df.fillna(method='ffill') # fill the value the same as upper one.

          0         1         2
0  0.638889 -0.628628  0.227867
1 -1.754156 -0.849572  0.499041
2  0.203560 -0.849572  0.121463
3 -0.383999 -0.849572  0.258524
4  0.650574 -0.849572  0.258524
5  0.912157 -0.849572  0.258524

* **value**: Scalar value or dict-like object to use to  ll missing values
* **method**: Interpolation; by default'ffill'if function called with no other 
* **axis**: arguments Axis to  ll on; defaultaxis=0
* **inplace**: Modify the calling object without producing a copy
* **limit**: For forward and backward  lling, maximum number of consecutive periods to  ll

# 2. Data Transformation

In [30]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                     'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [31]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

The DataFrame method duplicated returns a boolean Series indicating whether each row is a duplicate or not.

In [32]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

drop_duplicates returns a DataFrame where the duplicated array is False

In [41]:
data.loc[~data.duplicated()]
# equal to drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [42]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
6  two   4

duplicated and drop_duplicates by default keep the first observed value combina‐ tion. Passing keep='last' will return the last one.

## Transforming Data Using a Function or Mapping

In [43]:
dict = {
'food': [
    'bacon', 'pulled pork', 'bacon',
    'Pastrami', 'corned beef', 'Bacon',
    'pastrami', 'honey ham', 'nova lox'],
'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]
}

data = pd.DataFrame(dict)
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [52]:
meat_to_animal = {
      'bacon': 'pig',
      'pulled pork': 'pig',
      'pastrami': 'cow',
      'corned beef': 'cow',
      'honey ham': 'pig',
      'nova lox': 'salmon'
}

Convert each value of food to lowercase using **str.lower** Series method.

In [60]:
lowercase_food = data['food'].str.lower()
type(lowercase_food)

pandas.core.series.Series

In [63]:
data['animal'] = lowercase_food.map(meat_to_animal)
# pass a dict-like object

The map method on a Series accepts a **function** or **dict-like object** containing a mapping.

In [64]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [65]:
# or pass a function
lowercase_food.map(lambda x: meat_to_animal[x])
# or 
# data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

Using map is a convenient way to perform element-wise transformations and other data cleaning–related operations.

## Replacing Values
Filling in missing data with the fillna method is a special case of more general value replacement. As you’ve already seen, map can be used to modify a subset of values in an object but replace provides a simpler and more flexible way to do so

In [68]:
data = pd.Series([1,2,3,999,4,999,5,999,6])
data

0      1
1      2
2      3
3    999
4      4
5    999
6      5
7    999
8      6
dtype: int64

In [69]:
data.replace(999, np.nan)

0    1.0
1    2.0
2    3.0
3    NaN
4    4.0
5    NaN
6    5.0
7    NaN
8    6.0
dtype: float64

In [73]:
data.replace([1,2], 100)

0    100
1    100
2      3
3    999
4      4
5    999
6      5
7    999
8      6
dtype: int64

In [74]:
data.replace([1,2], [100,200])

0    100
1    200
2      3
3    999
4      4
5    999
6      5
7    999
8      6
dtype: int64

In [76]:
data.replace({
    1: 100,
    2: 200,
    3: 300
})

0    100
1    200
2    300
3    999
4      4
5    999
6      5
7    999
8      6
dtype: int64

## Renaming Axis Indexes